tutorials/compressible/rhoPimpleFoam/RAS/annularThermalMixer/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

AMI.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}

shaft.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}

wall.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}

statorBlades.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}

rotorBlades.obj
{
    #include "surfaceFeatureExtractDictDefaults"
}


// ************************************************************************* //
